In [1]:
import pandas as pd

Q1. Create a DataFrame containing student information like Name, Age, Department, %Marks

Display column names of the DF

Show min/max and average marks

Get unique values and student count for each Department

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva","Mrugank","Vedant"],
    "Age": [20, 21, 19, 22, 20, 22, 22],
    "Department": ["Computer Science", "Mathematics", "Physics", "Mathematics", "Physics", "Mathematics", "Mathematics"],
    "Marks": [88, 92, 85, 78, 90, 95, 100]
}
df = pd.DataFrame(data)
df

      Name  Age        Department  Marks
0    Alice   20  Computer Science     88
1      Bob   21       Mathematics     92
2  Charlie   19           Physics     85
3    David   22       Mathematics     78
4      Eva   20           Physics     90
5  Mrugank   22       Mathematics     95
6   Vedant   22       Mathematics    100

In [3]:
df.describe()

             Age       Marks
count   7.000000    7.000000
mean   20.857143   89.714286
std     1.214986    7.087884
min    19.000000   78.000000
25%    20.000000   86.500000
50%    21.000000   90.000000
75%    22.000000   93.500000
max    22.000000  100.000000

In [4]:
min_marks = df["Marks"].min()
max_marks = df["Marks"].max()
avg_marks = df["Marks"].mean()

In [5]:
print(min_marks)
print(max_marks)
print(avg_marks)

78
100
89.71428571428571

In [6]:
unique_departments = df["Department"].unique()
unique_departments

array(['Computer Science', 'Mathematics', 'Physics'], dtype=object)

In [7]:
student_count_per_dept = df["Department"].value_counts()
student_count_per_dept

Department
Mathematics         4
Physics             2
Computer Science    1
Name: count, dtype: int64


Q2. Read csv file solar.csv

Display all the plants with capacity > 500 MW

Display plant details for New York plant

For all the plants display Average MW Per Plant and Generation (GWh)

Sort the plants by Generation (GWh) (ascending) and Installed Capacity (MW)(descending)

List top 5 plants for their Generation

Display all plant details for states – California, Nevada, Arizona and Texas

Group the plants by region, find – min/max capacity plant for each group

Add following information to the existing details for the plants

North Carolina
148
669
4.5
1162
North

In [18]:
data = pd.read_csv("solar.csv")
data

,State,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
0,California,289,4395,15.3,10826,West
1,Arizona,48,1078,22.5,2550,West
2,Nevada,11,238,21.6,557,West
3,Chicago,33,261,7.9,590,North
4,Connecticut,20,118,5.9,235,East
5,Texas,12,187,15.6,354,South
6,New York,13,53,4.1,84,East
7,Florida,15,535,12.3,453,South

In [20]:
data = data.set_index("State")

In [10]:
data

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Arizona,48,1078,22.5,2550,West
Nevada,11,238,21.6,557,West
Chicago,33,261,7.9,590,North
Connecticut,20,118,5.9,235,East
Texas,12,187,15.6,354,South
New York,13,53,4.1,84,East
Florida,15,535,12.3,453,South

In [11]:
data.count()

Number of Solar Plants     8
Installed Capacity (MW)    8
Average MW Per Plant       8
Generation (GWh)           8
Region                     8
dtype: int64

In [12]:
d1 = data['Installed Capacity (MW)'] > 500
data[d1]

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Arizona,48,1078,22.5,2550,West
Florida,15,535,12.3,453,South

In [13]:
data.loc['New York']

Number of Solar Plants       13
Installed Capacity (MW)      53
Average MW Per Plant        4.1
Generation (GWh)             84
Region                     East
Name: New York, dtype: object

In [14]:
# d2 = data["Average MW Per Plant", "Generation (GWh)"]
# data[d2]
d2 = data[["Average MW Per Plant", "Generation (GWh)"]]
print(d2)

             Average MW Per Plant  Generation (GWh)
State
California                   15.3             10826
Arizona                      22.5              2550
Nevada                       21.6               557
Chicago                       7.9               590
Connecticut                   5.9               235
Texas                        15.6               354
New York                      4.1                84
Florida                      12.3               453

In [15]:
# Sort the plants by Generation (GWh) (ascending) and Installed Capacity (MW)(descending)
sorted_data = data.sort_values(by=["Generation (GWh)", "Installed Capacity (MW)"], ascending=[True, False])
sorted_data

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
New York,13,53,4.1,84,East
Connecticut,20,118,5.9,235,East
Texas,12,187,15.6,354,South
Florida,15,535,12.3,453,South
Nevada,11,238,21.6,557,West
Chicago,33,261,7.9,590,North
Arizona,48,1078,22.5,2550,West
California,289,4395,15.3,10826,West

In [16]:
# List top 5 plants for their Generation
top5_generation = data.sort_values(by="Generation (GWh)", ascending=False).head(5)
top5_generation

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Arizona,48,1078,22.5,2550,West
Chicago,33,261,7.9,590,North
Nevada,11,238,21.6,557,West
Florida,15,535,12.3,453,South

In [24]:
# Display all plant details for states – California, Nevada, Arizona and Texas
plant_details = data.loc[["California", "Nevada", "Arizona", "Texas"]]
plant_details

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Nevada,11,238,21.6,557,West
Arizona,48,1078,22.5,2550,West
Texas,12,187,15.6,354,South

In [25]:
# Group the plants by region, find – min/max capacity plant for each group
capacity = data.groupby("Region")["Installed Capacity (MW)"].agg(["min", "max"])
capacity

        min   max
Region
East     53   118
North   261   261
South   187   535
West    238  4395

In [26]:
# Add following information to the existing details for the plants

# North Carolina
# 148
# 669
# 4.5
# 1162
# North

new_row = {
    "State": "North Carolina",
    "Number of Solar Plants": 148,
    "Installed Capacity (MW)": 669,
    "Average MW Per Plant": 4.5,
    "Generation (GWh)": 1162,
    "Region": "North"
}
data = pd.concat([data, pd.DataFrame([new_row])], ignore_index=True)
data

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region,State
0,289,4395,15.3,10826,West,NaN
1,48,1078,22.5,2550,West,NaN
2,11,238,21.6,557,West,NaN
3,33,261,7.9,590,North,NaN
4,20,118,5.9,235,East,NaN
5,12,187,15.6,354,South,NaN
6,13,53,4.1,84,East,NaN
7,15,535,12.3,453,South,NaN
8,148,669,4.5,1162,North,North Carolina

Q.3Read csv gapminder2007.csv

Display data for all Asian countries

Display top and bottom 15 rows

Show all the rows where life expectancy is more than 50 years and less than 80 years

Show data for India, America and France

Show data for all countries where name starts with ‘A’

Show min/max and mean GDP and Population for each continent

Show population and life expectancy for all countries 

Sort the data by country names (ascending) and GDP (descending)

Find top 20 most populous countries

Delete all rows for a specific country

Change all column names to title case

Change column names: pop to Population, gdpPercap to GDP_Percap

Increase Life Expectancy by 2 years for all African countries

Find all the rows that contain NA values

Fill NA values with 0 for numeric columns

In [29]:
data = pd.read_csv("gapminder2007.csv")
data

                country       pop continent  lifeExp     gdpPercap
0           Afghanistan  31889923      Asia   43.828    974.580338
1               Albania   3600523    Europe   76.423   5937.029526
2               Algeria  33333216    Africa   72.301   6223.367465
3                Angola  12420476    Africa   42.731   4797.231267
4             Argentina  40301927  Americas   75.320  12779.379640
..                  ...       ...       ...      ...           ...
137             Vietnam  85262356      Asia   74.249   2441.576404
138  West Bank and Gaza   4018332      Asia   73.422   3025.349798
139         Yemen, Rep.  22211743      Asia   62.698   2280.769906
140              Zambia  11746035    Africa   42.384   1271.211593
141            Zimbabwe  12311143    Africa   43.487    469.709298

[142 rows x 5 columns]

In [31]:
# Display data for all Asian countries
data_asia = data[data["continent"] == "Asia"]
data_asia

                country         pop continent  lifeExp     gdpPercap
0           Afghanistan    31889923      Asia   43.828    974.580338
7               Bahrain      708573      Asia   75.635  29796.048340
8            Bangladesh   150448339      Asia   64.062   1391.253792
18             Cambodia    14131858      Asia   59.723   1713.778686
24                China  1318683096      Asia   72.961   4959.114854
55     Hong Kong, China     6980412      Asia   82.208  39724.978670
58                India  1110396331      Asia   64.698   2452.210407
59            Indonesia   223547000      Asia   70.650   3540.651564
60                 Iran    69453570      Asia   70.964  11605.714490
61                 Iraq    27499638      Asia   59.545   4471.061906
63               Israel     6426679      Asia   80.745  25523.277100
66                Japan   127467972      Asia   82.603  31656.068060
67               Jordan     6053193      Asia   72.535   4519.461171
69     Korea, Dem. Rep.    23301725      Asia   67.297   1593.065480
70          Korea, Rep.    49044790      Asia   78.623  23348.139730
71               Kuwait     2505559      Asia   77.588  47306.989780
72              Lebanon     3921278      Asia   71.993  10461.058680
78             Malaysia    24821286      Asia   74.241  12451.655800
83             Mongolia     2874127      Asia   66.803   3095.772271
87              Myanmar    47761980      Asia   62.069    944.000000
89                Nepal    28901790      Asia   63.785   1091.359778
96                 Oman     3204897      Asia   75.640  22316.192870
97             Pakistan   169270617      Asia   65.483   2605.947580
101         Philippines    91077287      Asia   71.688   3190.481016
109        Saudi Arabia    27601038      Asia   72.777  21654.831940
113           Singapore     4553009      Asia   79.972  47143.179640
119           Sri Lanka    20378239      Asia   72.396   3970.095407
124               Syria    19314747      Asia   74.143   4184.548089
125              Taiwan    23174294      Asia   78.400  28718.276840
127            Thailand    65068149      Asia   70.616   7458.396327
137             Vietnam    85262356      Asia   74.249   2441.576404
138  West Bank and Gaza     4018332      Asia   73.422   3025.349798
139         Yemen, Rep.    22211743      Asia   62.698   2280.769906

In [32]:
# Display top and bottom 15 rows
# Combine top and bottom 15 rows
combine = pd.concat([data.head(15), data.tail(15)])
combine

                    country        pop continent  lifeExp     gdpPercap
0               Afghanistan   31889923      Asia   43.828    974.580338
1                   Albania    3600523    Europe   76.423   5937.029526
2                   Algeria   33333216    Africa   72.301   6223.367465
3                    Angola   12420476    Africa   42.731   4797.231267
4                 Argentina   40301927  Americas   75.320  12779.379640
5                 Australia   20434176   Oceania   81.235  34435.367440
6                   Austria    8199783    Europe   79.829  36126.492700
7                   Bahrain     708573      Asia   75.635  29796.048340
8                Bangladesh  150448339      Asia   64.062   1391.253792
9                   Belgium   10392226    Europe   79.441  33692.605080
10                    Benin    8078314    Africa   56.728   1441.284873
11                  Bolivia    9119152  Americas   65.554   3822.137084
12   Bosnia and Herzegovina    4552198    Europe   74.852   7446.298803
13                 Botswana    1639131    Africa   50.728  12569.851770
14                   Brazil  190010647  Americas   72.390   9065.800825
127                Thailand   65068149      Asia   70.616   7458.396327
128                    Togo    5701579    Africa   58.420    882.969944
129     Trinidad and Tobago    1056608  Americas   69.819  18008.509240
130                 Tunisia   10276158    Africa   73.923   7092.923025
131                  Turkey   71158647    Europe   71.777   8458.276384
132                  Uganda   29170398    Africa   51.542   1056.380121
133          United Kingdom   60776238    Europe   79.425  33203.261280
134           United States  301139947  Americas   78.242  42951.653090
135                 Uruguay    3447496  Americas   76.384  10611.462990
136               Venezuela   26084662  Americas   73.747  11415.805690
137                 Vietnam   85262356      Asia   74.249   2441.576404
138      West Bank and Gaza    4018332      Asia   73.422   3025.349798
139             Yemen, Rep.   22211743      Asia   62.698   2280.769906
140                  Zambia   11746035    Africa   42.384   1271.211593
141                Zimbabwe   12311143    Africa   43.487    469.709298

In [33]:
# Show all the rows where life expectancy is more than 50 years and less than 80 years
life = data[(data["lifeExp"] > 50) & (data["lifeExp"] < 80)]
life

                country       pop continent  lifeExp     gdpPercap
1               Albania   3600523    Europe   76.423   5937.029526
2               Algeria  33333216    Africa   72.301   6223.367465
4             Argentina  40301927  Americas   75.320  12779.379640
6               Austria   8199783    Europe   79.829  36126.492700
7               Bahrain    708573      Asia   75.635  29796.048340
..                  ...       ...       ...      ...           ...
135             Uruguay   3447496  Americas   76.384  10611.462990
136           Venezuela  26084662  Americas   73.747  11415.805690
137             Vietnam  85262356      Asia   74.249   2441.576404
138  West Bank and Gaza   4018332      Asia   73.422   3025.349798
139         Yemen, Rep.  22211743      Asia   62.698   2280.769906

[110 rows x 5 columns]

In [34]:
# Show data for India, America and France
country = data[data["country"].isin(["India", "America", "France"])]
country

   country         pop continent  lifeExp     gdpPercap
44  France    61083916    Europe   80.657  30470.016700
58   India  1110396331      Asia   64.698   2452.210407

In [35]:
# Show data for all countries where name starts with ‘A’
country_A = data[data["country"].str.startswith("A")]
country_A

       country       pop continent  lifeExp     gdpPercap
0  Afghanistan  31889923      Asia   43.828    974.580338
1      Albania   3600523    Europe   76.423   5937.029526
2      Algeria  33333216    Africa   72.301   6223.367465
3       Angola  12420476    Africa   42.731   4797.231267
4    Argentina  40301927  Americas   75.320  12779.379640
5    Australia  20434176   Oceania   81.235  34435.367440
6      Austria   8199783    Europe   79.829  36126.492700

In [36]:
# Show min/max and mean GDP and Population for each continent
continent_stats = data.groupby("continent").agg({
    "gdpPercap": ["min", "max", "mean"],
    "pop": ["min", "max", "mean"]
})
continent_stats

              gdpPercap                                 pop              \
                    min          max          mean      min         max
continent
Africa       277.551859  13206.48452   3089.032605   199579   135031164
Americas    1201.637154  42951.65309  11003.031625  1056608   301139947
Asia         944.000000  47306.98978  12473.026870   708573  1318683096
Europe      5937.029526  49357.19017  25054.481636   301931    82400996
Oceania    25185.009110  34435.36744  29810.188275  4115771    20434176


                   mean
continent
Africa     1.787576e+07
Americas   3.595485e+07
Asia       1.155138e+08
Europe     1.953662e+07
Oceania    1.227497e+07

In [37]:
# Show population and life expectancy for all countries
population_life = data[["country","lifeExp"]]
population_life

                country  lifeExp
0           Afghanistan   43.828
1               Albania   76.423
2               Algeria   72.301
3                Angola   42.731
4             Argentina   75.320
..                  ...      ...
137             Vietnam   74.249
138  West Bank and Gaza   73.422
139         Yemen, Rep.   62.698
140              Zambia   42.384
141            Zimbabwe   43.487

[142 rows x 2 columns]

In [38]:
# Sort the data by country names (ascending) and GDP (descending)
sorted_data = data.sort_values(by=["country", "gdpPercap"], ascending=[True, False])
sorted_data

                country       pop continent  lifeExp     gdpPercap
0           Afghanistan  31889923      Asia   43.828    974.580338
1               Albania   3600523    Europe   76.423   5937.029526
2               Algeria  33333216    Africa   72.301   6223.367465
3                Angola  12420476    Africa   42.731   4797.231267
4             Argentina  40301927  Americas   75.320  12779.379640
..                  ...       ...       ...      ...           ...
137             Vietnam  85262356      Asia   74.249   2441.576404
138  West Bank and Gaza   4018332      Asia   73.422   3025.349798
139         Yemen, Rep.  22211743      Asia   62.698   2280.769906
140              Zambia  11746035    Africa   42.384   1271.211593
141            Zimbabwe  12311143    Africa   43.487    469.709298

[142 rows x 5 columns]

In [39]:
# Find top 20 most populous countries
sort_by_population =  data.sort_values(by = ["pop"], ascending = [False]).head(20)
sort_by_population

              country         pop continent  lifeExp     gdpPercap
24              China  1318683096      Asia   72.961   4959.114854
58              India  1110396331      Asia   64.698   2452.210407
134     United States   301139947  Americas   78.242  42951.653090
59          Indonesia   223547000      Asia   70.650   3540.651564
14             Brazil   190010647  Americas   72.390   9065.800825
97           Pakistan   169270617      Asia   65.483   2605.947580
8          Bangladesh   150448339      Asia   64.062   1391.253792
94            Nigeria   135031164    Africa   46.859   2013.977305
66              Japan   127467972      Asia   82.603  31656.068060
82             Mexico   108700891  Americas   76.195  11977.574960
101       Philippines    91077287      Asia   71.688   3190.481016
137           Vietnam    85262356      Asia   74.249   2441.576404
47            Germany    82400996    Europe   79.406  32170.374420
38              Egypt    80264543    Africa   71.338   5581.180998
42           Ethiopia    76511887    Africa   52.947    690.805576
131            Turkey    71158647    Europe   71.777   8458.276384
60               Iran    69453570      Asia   70.964  11605.714490
127          Thailand    65068149      Asia   70.616   7458.396327
27   Congo, Dem. Rep.    64606759    Africa   46.462    277.551859
44             France    61083916    Europe   80.657  30470.016700

In [43]:
# Delete all rows for a specific country
df_rows_removed = data.drop(0)
df_rows_removed

                country       pop continent  lifeExp     gdpPercap
1               Albania   3600523    Europe   76.423   5937.029526
2               Algeria  33333216    Africa   72.301   6223.367465
3                Angola  12420476    Africa   42.731   4797.231267
4             Argentina  40301927  Americas   75.320  12779.379640
5             Australia  20434176   Oceania   81.235  34435.367440
..                  ...       ...       ...      ...           ...
137             Vietnam  85262356      Asia   74.249   2441.576404
138  West Bank and Gaza   4018332      Asia   73.422   3025.349798
139         Yemen, Rep.  22211743      Asia   62.698   2280.769906
140              Zambia  11746035    Africa   42.384   1271.211593
141            Zimbabwe  12311143    Africa   43.487    469.709298

[141 rows x 5 columns]

In [44]:
# Change all column names to title case
data.columns = [col.title() for col in data.columns]
data

                Country       Pop Continent  Lifeexp     Gdppercap
0           Afghanistan  31889923      Asia   43.828    974.580338
1               Albania   3600523    Europe   76.423   5937.029526
2               Algeria  33333216    Africa   72.301   6223.367465
3                Angola  12420476    Africa   42.731   4797.231267
4             Argentina  40301927  Americas   75.320  12779.379640
..                  ...       ...       ...      ...           ...
137             Vietnam  85262356      Asia   74.249   2441.576404
138  West Bank and Gaza   4018332      Asia   73.422   3025.349798
139         Yemen, Rep.  22211743      Asia   62.698   2280.769906
140              Zambia  11746035    Africa   42.384   1271.211593
141            Zimbabwe  12311143    Africa   43.487    469.709298

[142 rows x 5 columns]

In [47]:
# Change column names: pop to Population, gdpPercap to GDP_Percap
data = data.rename(columns={'Pop': 'Population', 'Gdppercap': 'GDP_Percap'})
data

                Country  Population Continent  Lifeexp    GDP_Percap
0           Afghanistan    31889923      Asia   43.828    974.580338
1               Albania     3600523    Europe   76.423   5937.029526
2               Algeria    33333216    Africa   72.301   6223.367465
3                Angola    12420476    Africa   42.731   4797.231267
4             Argentina    40301927  Americas   75.320  12779.379640
..                  ...         ...       ...      ...           ...
137             Vietnam    85262356      Asia   74.249   2441.576404
138  West Bank and Gaza     4018332      Asia   73.422   3025.349798
139         Yemen, Rep.    22211743      Asia   62.698   2280.769906
140              Zambia    11746035    Africa   42.384   1271.211593
141            Zimbabwe    12311143    Africa   43.487    469.709298

[142 rows x 5 columns]

In [48]:
# Increase Life Expectancy by 2 years for all African countries
data.loc[data['Continent'] == 'Africa', 'Lifeexp'] += 2
data

                Country  Population Continent  Lifeexp    GDP_Percap
0           Afghanistan    31889923      Asia   43.828    974.580338
1               Albania     3600523    Europe   76.423   5937.029526
2               Algeria    33333216    Africa   74.301   6223.367465
3                Angola    12420476    Africa   44.731   4797.231267
4             Argentina    40301927  Americas   75.320  12779.379640
..                  ...         ...       ...      ...           ...
137             Vietnam    85262356      Asia   74.249   2441.576404
138  West Bank and Gaza     4018332      Asia   73.422   3025.349798
139         Yemen, Rep.    22211743      Asia   62.698   2280.769906
140              Zambia    11746035    Africa   44.384   1271.211593
141            Zimbabwe    12311143    Africa   45.487    469.709298

[142 rows x 5 columns]

In [49]:
# Find all the rows that contain NA values
rows_with_na = data[data.isna().any(axis=1)]
rows_with_na

Empty DataFrame
Columns: [Country, Population, Continent, Lifeexp, GDP_Percap]
Index: []

In [50]:
# Fill NA values with 0 for numeric column
rows_with_na.fillna(0)

Empty DataFrame
Columns: [Country, Population, Continent, Lifeexp, GDP_Percap]
Index: []